-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: mydb
-- ------------------------------------------------------
-- Server version	9.1.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `items`
--

DROP TABLE IF EXISTS `items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `items` (
  `id` int NOT NULL AUTO_INCREMENT,
  `userid` int NOT NULL,
  `listname` varchar(45) NOT NULL,
  `listitem` varchar(45) NOT NULL,
  `quantity` int NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `price` decimal(10,2) DEFAULT '0.00',
  `total` double DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `fk_listname` (`listname`),
  KEY `items_ibfk_1` (`userid`),
  CONSTRAINT `items_ibfk_1` FOREIGN KEY (`userid`) REFERENCES `user` (`userid`)
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `items`
--

LOCK TABLES `items` WRITE;
/*!40000 ALTER TABLE `items` DISABLE KEYS */;
INSERT INTO `items` VALUES (1,1,'ค่าอาหาร','ข้าวมันไก่',1,'2024-12-30 01:15:00',50.00,50),(2,1,'ค่าอาหาร','กาแฟ',2,'2024-12-30 02:00:00',60.00,120),(3,2,'ช้อปปิ้ง','เสื้อผ้า',2,'2024-12-30 11:15:00',500.00,1000),(4,2,'ช้อปปิ้ง','รองเท้า',1,'2024-12-30 12:00:00',500.00,500),(5,4,'ค่าบ้าน','ค่าเช่า',1,'2024-11-05 03:30:00',8000.00,8000),(6,5,'ค่ารถยนต์','ค่างวด',1,'2024-11-15 08:30:00',5500.00,5500),(7,1,'ค่าเบี้ยประกัน','ประกันชีวิต',1,'2023-01-15 03:30:00',10000.00,10000),(8,2,'ค่าเล่าเรียน','ค่าเทอม',1,'2023-06-10 07:30:00',25000.00,25000),(9,2,'ค่าใช้จ่าย','สินค้า1',1,'2024-12-31 07:18:20',200.00,200),(10,2,'รายไปโรงเรียน','ค่าขนม',2,'2024-12-31 07:30:29',20.00,40),(11,2,'test','test',2,'2024-12-31 07:49:40',33.00,66),(12,1,'test admin','admim',2,'2024-12-31 07:50:54',55.00,110),(13,2,'ค่าขนมปัง','2',2,'2024-12-31 08:12:55',2.00,4),(14,2,'ทดสอบ','สินค้า',5,'2024-12-31 08:24:00',30.00,150),(15,2,'ทดสอบ','ทดสอบ',1,'2024-12-31 08:40:55',30.00,30),(16,1,'test','test',2,'2024-12-31 14:56:06',2200.00,4400),(17,12,'test','test',3,'2024-12-31 14:58:08',300.00,900),(18,12,'test','1',1,'2025-01-01 11:30:25',11.00,11),(19,3,'test 25','25',12,'2025-01-01 11:32:48',22.00,264),(20,12,'test2525','gmm',2,'2025-01-01 12:10:29',2.00,4),(21,3,'test2555','tese',12,'2025-01-01 12:16:32',10.00,120),(22,12,'tesr258','test',2,'2025-01-01 13:24:39',32.00,64),(23,12,'teseivp','uu',20,'2025-01-01 13:50:16',2.00,40),(24,12,'test111','111',1,'2025-01-01 14:21:51',11.00,11),(25,12,'test222','222',12,'2025-01-01 14:22:03',11.00,132),(26,12,'test333','33',3,'2025-01-01 14:22:25',33.00,99),(27,12,'tes22','22',2,'2025-01-01 14:23:25',22.00,44),(28,12,'test2222','22',22,'2025-01-01 14:24:25',200.00,4400),(29,12,'tesyy','yy',1,'2025-01-01 14:27:23',12.00,12),(30,12,'test99','99',99,'2025-01-01 14:59:58',99.00,9801),(31,12,'test998','998',98,'2025-01-01 15:00:39',98.00,9604),(32,1,'งานวันเกิด','ค่าเค้ก',2,'2025-01-01 16:33:34',100.00,200),(33,1,'งานวันเกิด','น้ำดื่ม',1,'2025-01-01 16:33:34',100.00,100),(34,2,'รายการอาหาร','อาหาร2',1,'2025-01-01 17:13:46',10.00,20),(35,2,'รายการอาหาร','อาหาร1',1,'2025-01-01 17:13:46',30.00,30),(36,14,'test1','test1',1,'2025-01-02 08:30:40',22.00,22),(37,14,'test1','test1.1',1,'2025-01-02 08:30:40',22.00,22),(38,14,'test5','test5',1,'2025-01-02 08:32:04',25.00,25),(39,14,'test5','test5.1',1,'2025-01-02 08:32:04',255.00,255),(40,1,'testnew','new1',2,'2025-01-02 10:36:35',2.00,4),(41,1,'testnew','new2',1,'2025-01-02 10:36:35',22.00,22),(42,15,'งานวันเกิด','เค้ก',1,'2025-01-04 07:24:03',200.00,200),(43,15,'งานวันเกิด','หมูกระทะ',2,'2025-01-04 07:24:03',500.00,1000),(44,15,'งานวันเกิด','ค่าของขวัญ',1,'2025-01-04 07:24:03',1000.00,1000),(45,2,'test','test',200,'2025-01-04 10:36:48',12.00,2400),(46,6,'testnew','item1',1,'2025-01-04 10:46:09',100.00,100),(47,6,'testnew','item2',2,'2025-01-04 10:46:09',200.00,400),(48,6,'test1','item1',1,'2025-01-04 10:47:17',100.00,100),(49,6,'test1','item2',2,'2025-01-04 10:47:17',100.00,200),(50,6,'testne','item1',2,'2025-01-04 11:12:51',200.00,400),(51,6,'testne','item1',1,'2025-01-04 11:12:51',300.00,300),(52,1,'วันเกิด','สินค้า1',2,'2025-01-07 03:54:26',200.00,400),(53,1,'วันเกิด','สินค้า2',2,'2025-01-07 03:54:26',300.00,600),(54,16,'ทดลองการสร้างรายการ1','สินค้า1',2,'2025-01-09 05:26:23',10.00,20),(55,16,'ทดลองการสร้างรายการ1','สินค้า2',1,'2025-01-09 05:26:23',20.00,20),(56,16,'ทดลองการสร้างรายการ1','สินค้า3',3,'2025-01-09 05:26:23',30.00,90),(57,16,'testnew','item1',1,'2025-01-09 07:08:50',100.00,100),(58,16,'testnew','item2',1,'2025-01-09 07:08:50',100.00,100),(59,17,'testlist','item1',2,'2025-01-10 06:47:28',1.00,2),(60,17,'testlist','สินค้า',2,'2025-01-10 06:47:28',20.00,40),(61,17,'test2','2',2,'2025-01-10 06:48:12',2.00,4),(62,17,'test55','test5',5,'2025-01-10 07:37:34',5.00,25),(63,17,'test55','tese',2,'2025-01-10 07:37:34',55.00,110),(64,1,'สินค้า','สินค้า1',2,'2025-01-10 13:42:31',200.00,400),(65,1,'สินค้า','สินค้า2',1,'2025-01-10 13:42:31',200.00,200);
/*!40000 ALTER TABLE `items` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-01-11 22:02:11
